Miceuz/framework-arduino-samr-catnip/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cpu=Microcontroller
menu.clock=Clock Source
menu.usb=USB Config
menu.serial=Serial Config
menu.bootloader=Bootloader Size
menu.timer=Timer PWM Frequency
menu.float=Floating Point
menu.config=Build Options

catnipelectronics_radiobus.name=RadioBus
catnipelectronics_radiobus.vid.0=0x1d50
catnipelectronics_radiobus.pid.0=0x600c
catnipelectronics_radiobus.build.usb_manufacturer="Catnip Electronics"
catnipelectronics_radiobus.build.board=SAMD_ZERO
catnipelectronics_radiobus.build.core=arduino
catnipelectronics_radiobus.build.variant=radiobus
catnipelectronics_radiobus.build.variant_system_lib=
catnipelectronics_radiobus.build.vid=0x1d50
catnipelectronics_radiobus.upload.protocol=sam-ba
catnipelectronics_radiobus.bootloader.tool=arduino:openocd
catnipelectronics_radiobus.menu.float.default=Print & String use auto-promoted doubles only
catnipelectronics_radiobus.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
catnipelectronics_radiobus.menu.float.print=Print uses separate singles and doubles
catnipelectronics_radiobus.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
catnipelectronics_radiobus.menu.float.string=String uses separate singles and doubles
catnipelectronics_radiobus.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
catnipelectronics_radiobus.menu.float.both=Print & String use separate singles and doubles
catnipelectronics_radiobus.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
catnipelectronics_radiobus.menu.config.disabled=config.h disabled
catnipelectronics_radiobus.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
catnipelectronics_radiobus.menu.config.enabled=config.h enabled (mostly code size reductions)
catnipelectronics_radiobus.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
catnipelectronics_radiobus.menu.clock.crystal_32k=32KHZ_CRYSTAL
catnipelectronics_radiobus.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
catnipelectronics_radiobus.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
catnipelectronics_radiobus.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
catnipelectronics_radiobus.menu.clock.internal=INTERNAL_OSCILLATOR
catnipelectronics_radiobus.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
catnipelectronics_radiobus.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
catnipelectronics_radiobus.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
catnipelectronics_radiobus.menu.timer.timer_732Hz=732.4Hz (16-bit)
catnipelectronics_radiobus.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
catnipelectronics_radiobus.menu.timer.timer_366Hz=366.2Hz (16-bit)
catnipelectronics_radiobus.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
catnipelectronics_radiobus.menu.timer.timer_244Hz=244.1Hz (16-bit)
catnipelectronics_radiobus.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
catnipelectronics_radiobus.menu.timer.timer_183Hz=183.1Hz (16-bit)
catnipelectronics_radiobus.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
catnipelectronics_radiobus.menu.timer.timer_146Hz=146.5Hz (16-bit)
catnipelectronics_radiobus.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
catnipelectronics_radiobus.menu.timer.timer_122Hz=122.1Hz (16-bit)
catnipelectronics_radiobus.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
catnipelectronics_radiobus.menu.timer.timer_105Hz=104.6Hz (16-bit)
catnipelectronics_radiobus.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
catnipelectronics_radiobus.menu.timer.timer_81Hz=81.38Hz (16-bit)
catnipelectronics_radiobus.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
catnipelectronics_radiobus.menu.timer.timer_61Hz=61.04Hz (16-bit)
catnipelectronics_radiobus.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
catnipelectronics_radiobus.menu.timer.timer_31Hz=30.52Hz (16-bit)
catnipelectronics_radiobus.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
catnipelectronics_radiobus.menu.timer.timer_187500Hz=187500Hz (8-bit)
catnipelectronics_radiobus.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
catnipelectronics_radiobus.menu.timer.timer_93750Hz=93750Hz (8-bit)
catnipelectronics_radiobus.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
catnipelectronics_radiobus.menu.timer.timer_62500Hz=62500Hz (8-bit)
catnipelectronics_radiobus.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
catnipelectronics_radiobus.menu.timer.timer_37500Hz=37500Hz (8-bit)
catnipelectronics_radiobus.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
catnipelectronics_radiobus.menu.timer.timer_20833Hz=20833Hz (8-bit)
catnipelectronics_radiobus.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
catnipelectronics_radiobus.menu.timer.timer_12500Hz=12500Hz (8-bit)
catnipelectronics_radiobus.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
catnipelectronics_radiobus.menu.timer.timer_7500Hz=7500Hz (8-bit)
catnipelectronics_radiobus.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
catnipelectronics_radiobus.menu.timer.timer_4166Hz=4166Hz (8-bit)
catnipelectronics_radiobus.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
catnipelectronics_radiobus.menu.timer.timer_2930Hz=2930Hz (8-bit)
catnipelectronics_radiobus.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
catnipelectronics_radiobus.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
catnipelectronics_radiobus.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz

catnipelectronics_radiobus.menu.cpu.radiobus=RadioBus
catnipelectronics_radiobus.menu.cpu.radiobus.upload.maximum_size=253952
catnipelectronics_radiobus.menu.cpu.radiobus.build.mcu=cortex-m0plus
catnipelectronics_radiobus.menu.cpu.radiobus.build.mathlib=arm_cortexM0l_math
catnipelectronics_radiobus.menu.cpu.radiobus.build.f_cpu=48000000L
catnipelectronics_radiobus.menu.cpu.radiobus.build.usb_product="Radio Bus"
catnipelectronics_radiobus.menu.cpu.radiobus.build.extra_flags=-D__SAMR34J18B__ {build.usb_flags} -DARM_MATH_CM0PLUS
catnipelectronics_radiobus.menu.cpu.radiobus.build.ldscript=flash_256KB.ld
catnipelectronics_radiobus.menu.cpu.radiobus.build.openocdscript=openocd_scripts/SAML21J18B.cfg
catnipelectronics_radiobus.menu.cpu.radiobus.bootloader.file=radiobus/bootloader-radiobus.bin

catnipelectronics_radiobus.menu.bootloader.8kb=8KB_BOOTLOADER
catnipelectronics_radiobus.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
catnipelectronics_radiobus.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
catnipelectronics_radiobus.menu.bootloader.8kb.upload.tool=bossac
catnipelectronics_radiobus.menu.bootloader.8kb.upload.use_1200bps_touch=true
catnipelectronics_radiobus.menu.bootloader.8kb.upload.wait_for_upload_port=true
catnipelectronics_radiobus.menu.bootloader.8kb.upload.native_usb=true
catnipelectronics_radiobus.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
catnipelectronics_radiobus.menu.serial.one_uart.build.serialcom_uart=ONE_UART
catnipelectronics_radiobus.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
catnipelectronics_radiobus.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
catnipelectronics_radiobus.menu.serial.one_uart_two_spi=ONE_UART_ONE_WIRE_TWO_SPI
catnipelectronics_radiobus.menu.serial.one_uart_two_spi.build.serialcom_uart=ONE_UART
catnipelectronics_radiobus.menu.serial.one_uart_two_spi.build.serialcom_wire=ONE_WIRE
catnipelectronics_radiobus.menu.serial.one_uart_two_spi.build.serialcom_spi=TWO_SPI
catnipelectronics_radiobus.menu.serial.one_uart_two_wire=ONE_UART_TWO_WIRE_ONE_SPI
catnipelectronics_radiobus.menu.serial.one_uart_two_wire.build.serialcom_uart=ONE_UART
catnipelectronics_radiobus.menu.serial.one_uart_two_wire.build.serialcom_wire=TWO_WIRE
catnipelectronics_radiobus.menu.serial.one_uart_two_wire.build.serialcom_spi=ONE_SPI
catnipelectronics_radiobus.menu.usb.cdc=CDC_ONLY
catnipelectronics_radiobus.menu.usb.cdc.build.usbcom=CDC_ONLY
catnipelectronics_radiobus.menu.usb.cdc.build.pid=0x0557
catnipelectronics_radiobus.menu.usb.cdc_hid=CDC_HID
catnipelectronics_radiobus.menu.usb.cdc_hid.build.usbcom=CDC_HID
catnipelectronics_radiobus.menu.usb.cdc_hid.build.pid=0x0856
catnipelectronics_radiobus.menu.usb.withcdc=WITH_CDC
catnipelectronics_radiobus.menu.usb.withcdc.build.usbcom=WITH_CDC
catnipelectronics_radiobus.menu.usb.withcdc.build.pid=0x0B41
catnipelectronics_radiobus.menu.usb.hid=HID_ONLY
catnipelectronics_radiobus.menu.usb.hid.build.usbcom=HID_ONLY
catnipelectronics_radiobus.menu.usb.hid.build.pid=0x0B40
catnipelectronics_radiobus.menu.usb.nocdc=WITHOUT_CDC
catnipelectronics_radiobus.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
catnipelectronics_radiobus.menu.usb.nocdc.build.pid=0x0A0C
catnipelectronics_radiobus.menu.usb.none=USB_DISABLED
catnipelectronics_radiobus.menu.usb.none.build.usbcom=USB_DISABLED
catnipelectronics_radiobus.menu.usb.none.build.pid=0x0856
